Revit 2027 API
BuiltInFailures.StairRampFailures.LandingShapeHandleOnPinnedRunFailure Property
 Cannot Drag the automatic landing shape handle control because the connected run is pinned.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId LandingShapeHandleOnPinnedRunFailure { get; }
Public Shared ReadOnly Property LandingShapeHandleOnPinnedRunFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ LandingShapeHandleOnPinnedRunFailure {
	FailureDefinitionId^ get ();
}
static member LandingShapeHandleOnPinnedRunFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace